// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12
System.Console.WriteLine("Введите число");
int numberA = Convert.ToInt32(Console.ReadLine());
int numberB = Lenght(numberA);
for (int i = 0; i < Length(numberA); i++)
{
    numberB = +0;
    System.Console.WriteLine();
}